MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K80/mcu.h
extern volatile B3SIDHbits_t B3SIDHbits __at(0xEB1);
// bitfield macros
#define _B3SIDH_SID_POSN                                    0x0
#define _B3SIDH_SID_POSITION                                0x0
#define _B3SIDH_SID_SIZE                                    0x8
#define _B3SIDH_SID_LENGTH                                  0x8
#define _B3SIDH_SID_MASK                                    0xFF
#define _B3SIDH_SID3_POSN                                   0x0
#define _B3SIDH_SID3_POSITION                               0x0
#define _B3SIDH_SID3_SIZE                                   0x1
#define _B3SIDH_SID3_LENGTH                                 0x1
#define _B3SIDH_SID3_MASK                                   0x1
#define _B3SIDH_SID4_POSN                                   0x1
#define _B3SIDH_SID4_POSITION                               0x1
#define _B3SIDH_SID4_SIZE                                   0x1
#define _B3SIDH_SID4_LENGTH                                 0x1
#define _B3SIDH_SID4_MASK                                   0x2
#define _B3SIDH_SID5_POSN                                   0x2
#define _B3SIDH_SID5_POSITION                               0x2
#define _B3SIDH_SID5_SIZE                                   0x1
#define _B3SIDH_SID5_LENGTH                                 0x1
#define _B3SIDH_SID5_MASK                                   0x4
#define _B3SIDH_SID6_POSN                                   0x3
#define _B3SIDH_SID6_POSITION                               0x3
#define _B3SIDH_SID6_SIZE                                   0x1
#define _B3SIDH_SID6_LENGTH                                 0x1
#define _B3SIDH_SID6_MASK                                   0x8
#define _B3SIDH_SID7_POSN                                   0x4
#define _B3SIDH_SID7_POSITION                               0x4
#define _B3SIDH_SID7_SIZE                                   0x1
#define _B3SIDH_SID7_LENGTH                                 0x1
#define _B3SIDH_SID7_MASK                                   0x10
#define _B3SIDH_SID8_POSN                                   0x5
#define _B3SIDH_SID8_POSITION                               0x5
#define _B3SIDH_SID8_SIZE                                   0x1
#define _B3SIDH_SID8_LENGTH                                 0x1
#define _B3SIDH_SID8_MASK                                   0x20
#define _B3SIDH_SID9_POSN                                   0x6
#define _B3SIDH_SID9_POSITION                               0x6
#define _B3SIDH_SID9_SIZE                                   0x1
#define _B3SIDH_SID9_LENGTH                                 0x1
#define _B3SIDH_SID9_MASK                                   0x40
#define _B3SIDH_SID10_POSN                                  0x7
#define _B3SIDH_SID10_POSITION                              0x7
#define _B3SIDH_SID10_SIZE                                  0x1
#define _B3SIDH_SID10_LENGTH                                0x1
#define _B3SIDH_SID10_MASK                                  0x80
#define _B3SIDH_B3SID3_POSN                                 0x0
#define _B3SIDH_B3SID3_POSITION                             0x0
#define _B3SIDH_B3SID3_SIZE                                 0x1
#define _B3SIDH_B3SID3_LENGTH                               0x1
#define _B3SIDH_B3SID3_MASK                                 0x1
#define _B3SIDH_B3SID4_POSN                                 0x1
#define _B3SIDH_B3SID4_POSITION                             0x1
#define _B3SIDH_B3SID4_SIZE                                 0x1
#define _B3SIDH_B3SID4_LENGTH                               0x1
#define _B3SIDH_B3SID4_MASK                                 0x2
#define _B3SIDH_B3SID5_POSN                                 0x2
#define _B3SIDH_B3SID5_POSITION                             0x2
#define _B3SIDH_B3SID5_SIZE                                 0x1
#define _B3SIDH_B3SID5_LENGTH                               0x1
#define _B3SIDH_B3SID5_MASK                                 0x4
#define _B3SIDH_B3SID6_POSN                                 0x3
#define _B3SIDH_B3SID6_POSITION                             0x3
#define _B3SIDH_B3SID6_SIZE                                 0x1
#define _B3SIDH_B3SID6_LENGTH                               0x1
#define _B3SIDH_B3SID6_MASK                                 0x8
#define _B3SIDH_B3SID7_POSN                                 0x4
#define _B3SIDH_B3SID7_POSITION                             0x4
#define _B3SIDH_B3SID7_SIZE                                 0x1
#define _B3SIDH_B3SID7_LENGTH                               0x1
#define _B3SIDH_B3SID7_MASK                                 0x10
#define _B3SIDH_B3SID8_POSN                                 0x5
#define _B3SIDH_B3SID8_POSITION                             0x5
#define _B3SIDH_B3SID8_SIZE                                 0x1
#define _B3SIDH_B3SID8_LENGTH                               0x1
#define _B3SIDH_B3SID8_MASK                                 0x20
#define _B3SIDH_B3SID9_POSN                                 0x6
#define _B3SIDH_B3SID9_POSITION                             0x6
#define _B3SIDH_B3SID9_SIZE                                 0x1
#define _B3SIDH_B3SID9_LENGTH                               0x1
#define _B3SIDH_B3SID9_MASK                                 0x40
#define _B3SIDH_B3SID10_POSN                                0x7
#define _B3SIDH_B3SID10_POSITION                            0x7
#define _B3SIDH_B3SID10_SIZE                                0x1
#define _B3SIDH_B3SID10_LENGTH                              0x1
#define _B3SIDH_B3SID10_MASK                                0x80

// Register: B3SIDL
#define B3SIDL B3SIDL
extern volatile unsigned char           B3SIDL              __at(0xEB2);
#ifndef _LIB_BUILD
asm("B3SIDL equ 0EB2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned SRR                    :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned B3EID16                :1;
        unsigned B3EID17                :1;
        unsigned                        :1;
        unsigned B3EXID                 :1;
        unsigned B3SRR                  :1;
        unsigned B3SID0                 :1;
        unsigned B3SID1                 :1;
        unsigned B3SID2                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned B3EXIDE                :1;
    };
} B3SIDLbits_t;
extern volatile B3SIDLbits_t B3SIDLbits __at(0xEB2);
// bitfield macros
#define _B3SIDL_EID_POSN                                    0x0
#define _B3SIDL_EID_POSITION                                0x0
#define _B3SIDL_EID_SIZE                                    0x2
#define _B3SIDL_EID_LENGTH                                  0x2
#define _B3SIDL_EID_MASK                                    0x3
#define _B3SIDL_EXIDE_POSN                                  0x3
#define _B3SIDL_EXIDE_POSITION                              0x3
#define _B3SIDL_EXIDE_SIZE                                  0x1
#define _B3SIDL_EXIDE_LENGTH                                0x1
#define _B3SIDL_EXIDE_MASK                                  0x8
#define _B3SIDL_SRR_POSN                                    0x4
#define _B3SIDL_SRR_POSITION                                0x4
#define _B3SIDL_SRR_SIZE                                    0x1
#define _B3SIDL_SRR_LENGTH                                  0x1
#define _B3SIDL_SRR_MASK                                    0x10
#define _B3SIDL_SID_POSN                                    0x5
#define _B3SIDL_SID_POSITION                                0x5
#define _B3SIDL_SID_SIZE                                    0x3
#define _B3SIDL_SID_LENGTH                                  0x3
#define _B3SIDL_SID_MASK                                    0xE0
#define _B3SIDL_EID16_POSN                                  0x0
#define _B3SIDL_EID16_POSITION                              0x0
#define _B3SIDL_EID16_SIZE                                  0x1
#define _B3SIDL_EID16_LENGTH                                0x1
#define _B3SIDL_EID16_MASK                                  0x1
#define _B3SIDL_EID17_POSN                                  0x1
#define _B3SIDL_EID17_POSITION                              0x1
#define _B3SIDL_EID17_SIZE                                  0x1
#define _B3SIDL_EID17_LENGTH                                0x1
#define _B3SIDL_EID17_MASK                                  0x2
#define _B3SIDL_SID0_POSN                                   0x5
#define _B3SIDL_SID0_POSITION                               0x5
#define _B3SIDL_SID0_SIZE                                   0x1
#define _B3SIDL_SID0_LENGTH                                 0x1
#define _B3SIDL_SID0_MASK                                   0x20
#define _B3SIDL_SID1_POSN                                   0x6
#define _B3SIDL_SID1_POSITION                               0x6
#define _B3SIDL_SID1_SIZE                                   0x1
#define _B3SIDL_SID1_LENGTH                                 0x1
#define _B3SIDL_SID1_MASK                                   0x40
#define _B3SIDL_SID2_POSN                                   0x7
#define _B3SIDL_SID2_POSITION                               0x7
#define _B3SIDL_SID2_SIZE                                   0x1
#define _B3SIDL_SID2_LENGTH                                 0x1
#define _B3SIDL_SID2_MASK                                   0x80
#define _B3SIDL_B3EID16_POSN                                0x0
#define _B3SIDL_B3EID16_POSITION                            0x0
#define _B3SIDL_B3EID16_SIZE                                0x1
#define _B3SIDL_B3EID16_LENGTH                              0x1
#define _B3SIDL_B3EID16_MASK                                0x1
#define _B3SIDL_B3EID17_POSN                                0x1
#define _B3SIDL_B3EID17_POSITION                            0x1
#define _B3SIDL_B3EID17_SIZE                                0x1
#define _B3SIDL_B3EID17_LENGTH                              0x1
#define _B3SIDL_B3EID17_MASK                                0x2
#define _B3SIDL_B3EXID_POSN                                 0x3
#define _B3SIDL_B3EXID_POSITION                             0x3
#define _B3SIDL_B3EXID_SIZE                                 0x1
#define _B3SIDL_B3EXID_LENGTH                               0x1
#define _B3SIDL_B3EXID_MASK                                 0x8
#define _B3SIDL_B3SRR_POSN                                  0x4
#define _B3SIDL_B3SRR_POSITION                              0x4
#define _B3SIDL_B3SRR_SIZE                                  0x1
#define _B3SIDL_B3SRR_LENGTH                                0x1
#define _B3SIDL_B3SRR_MASK                                  0x10
#define _B3SIDL_B3SID0_POSN                                 0x5
#define _B3SIDL_B3SID0_POSITION                             0x5
#define _B3SIDL_B3SID0_SIZE                                 0x1
#define _B3SIDL_B3SID0_LENGTH                               0x1
#define _B3SIDL_B3SID0_MASK                                 0x20
#define _B3SIDL_B3SID1_POSN                                 0x6
#define _B3SIDL_B3SID1_POSITION                             0x6
#define _B3SIDL_B3SID1_SIZE                                 0x1
#define _B3SIDL_B3SID1_LENGTH                               0x1
#define _B3SIDL_B3SID1_MASK                                 0x40
#define _B3SIDL_B3SID2_POSN                                 0x7
#define _B3SIDL_B3SID2_POSITION                             0x7
#define _B3SIDL_B3SID2_SIZE                                 0x1
#define _B3SIDL_B3SID2_LENGTH                               0x1
#define _B3SIDL_B3SID2_MASK                                 0x80
#define _B3SIDL_B3EXIDE_POSN                                0x3
#define _B3SIDL_B3EXIDE_POSITION                            0x3
#define _B3SIDL_B3EXIDE_SIZE                                0x1
#define _B3SIDL_B3EXIDE_LENGTH                              0x1
#define _B3SIDL_B3EXIDE_MASK                                0x8

// Register: B3EIDH
#define B3EIDH B3EIDH
extern volatile unsigned char           B3EIDH              __at(0xEB3);
#ifndef _LIB_BUILD
asm("B3EIDH equ 0EB3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned B3EID8                 :1;
        unsigned B3EID9                 :1;
        unsigned B3EID10                :1;
        unsigned B3EID11                :1;
        unsigned B3EID12                :1;
        unsigned B3EID13                :1;
        unsigned B3EID14                :1;
        unsigned B3EID15                :1;
    };
} B3EIDHbits_t;
extern volatile B3EIDHbits_t B3EIDHbits __at(0xEB3);
// bitfield macros
#define _B3EIDH_EID_POSN                                    0x0
#define _B3EIDH_EID_POSITION                                0x0
#define _B3EIDH_EID_SIZE                                    0x8
#define _B3EIDH_EID_LENGTH                                  0x8
#define _B3EIDH_EID_MASK                                    0xFF
#define _B3EIDH_EID8_POSN                                   0x0
#define _B3EIDH_EID8_POSITION                               0x0
#define _B3EIDH_EID8_SIZE                                   0x1
#define _B3EIDH_EID8_LENGTH                                 0x1
#define _B3EIDH_EID8_MASK                                   0x1
#define _B3EIDH_EID9_POSN                                   0x1
#define _B3EIDH_EID9_POSITION                               0x1
#define _B3EIDH_EID9_SIZE                                   0x1
#define _B3EIDH_EID9_LENGTH                                 0x1
#define _B3EIDH_EID9_MASK                                   0x2
#define _B3EIDH_EID10_POSN                                  0x2
#define _B3EIDH_EID10_POSITION                              0x2
#define _B3EIDH_EID10_SIZE                                  0x1
#define _B3EIDH_EID10_LENGTH                                0x1
#define _B3EIDH_EID10_MASK                                  0x4
#define _B3EIDH_EID11_POSN                                  0x3
#define _B3EIDH_EID11_POSITION                              0x3
#define _B3EIDH_EID11_SIZE                                  0x1
#define _B3EIDH_EID11_LENGTH                                0x1
#define _B3EIDH_EID11_MASK                                  0x8
#define _B3EIDH_EID12_POSN                                  0x4
#define _B3EIDH_EID12_POSITION                              0x4
#define _B3EIDH_EID12_SIZE                                  0x1
#define _B3EIDH_EID12_LENGTH                                0x1
#define _B3EIDH_EID12_MASK                                  0x10
#define _B3EIDH_EID13_POSN                                  0x5
#define _B3EIDH_EID13_POSITION                              0x5
#define _B3EIDH_EID13_SIZE                                  0x1
#define _B3EIDH_EID13_LENGTH                                0x1
#define _B3EIDH_EID13_MASK                                  0x20
#define _B3EIDH_EID14_POSN                                  0x6
#define _B3EIDH_EID14_POSITION                              0x6
#define _B3EIDH_EID14_SIZE                                  0x1
#define _B3EIDH_EID14_LENGTH                                0x1
#define _B3EIDH_EID14_MASK                                  0x40
#define _B3EIDH_EID15_POSN                                  0x7
#define _B3EIDH_EID15_POSITION                              0x7
#define _B3EIDH_EID15_SIZE                                  0x1
#define _B3EIDH_EID15_LENGTH                                0x1
#define _B3EIDH_EID15_MASK                                  0x80
#define _B3EIDH_B3EID8_POSN                                 0x0
#define _B3EIDH_B3EID8_POSITION                             0x0
#define _B3EIDH_B3EID8_SIZE                                 0x1
#define _B3EIDH_B3EID8_LENGTH                               0x1
#define _B3EIDH_B3EID8_MASK                                 0x1
#define _B3EIDH_B3EID9_POSN                                 0x1
#define _B3EIDH_B3EID9_POSITION                             0x1
#define _B3EIDH_B3EID9_SIZE                                 0x1
#define _B3EIDH_B3EID9_LENGTH                               0x1
#define _B3EIDH_B3EID9_MASK                                 0x2
#define _B3EIDH_B3EID10_POSN                                0x2
#define _B3EIDH_B3EID10_POSITION                            0x2
#define _B3EIDH_B3EID10_SIZE                                0x1
#define _B3EIDH_B3EID10_LENGTH                              0x1
#define _B3EIDH_B3EID10_MASK                                0x4
#define _B3EIDH_B3EID11_POSN                                0x3
#define _B3EIDH_B3EID11_POSITION                            0x3
#define _B3EIDH_B3EID11_SIZE                                0x1
#define _B3EIDH_B3EID11_LENGTH                              0x1
#define _B3EIDH_B3EID11_MASK                                0x8
#define _B3EIDH_B3EID12_POSN                                0x4
#define _B3EIDH_B3EID12_POSITION                            0x4
#define _B3EIDH_B3EID12_SIZE                                0x1
#define _B3EIDH_B3EID12_LENGTH                              0x1
#define _B3EIDH_B3EID12_MASK                                0x10
#define _B3EIDH_B3EID13_POSN                                0x5
#define _B3EIDH_B3EID13_POSITION                            0x5
#define _B3EIDH_B3EID13_SIZE                                0x1
#define _B3EIDH_B3EID13_LENGTH                              0x1
#define _B3EIDH_B3EID13_MASK                                0x20
#define _B3EIDH_B3EID14_POSN                                0x6
#define _B3EIDH_B3EID14_POSITION                            0x6
#define _B3EIDH_B3EID14_SIZE                                0x1
#define _B3EIDH_B3EID14_LENGTH                              0x1
#define _B3EIDH_B3EID14_MASK                                0x40
#define _B3EIDH_B3EID15_POSN                                0x7
#define _B3EIDH_B3EID15_POSITION                            0x7
#define _B3EIDH_B3EID15_SIZE                                0x1
#define _B3EIDH_B3EID15_LENGTH                              0x1
#define _B3EIDH_B3EID15_MASK                                0x80

// Register: B3EIDL
#define B3EIDL B3EIDL
extern volatile unsigned char           B3EIDL              __at(0xEB4);
#ifndef _LIB_BUILD
asm("B3EIDL equ 0EB4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned B3EID0                 :1;
        unsigned B3EID1                 :1;
        unsigned B3EID2                 :1;
        unsigned B3EID3                 :1;
        unsigned B3EID4                 :1;
        unsigned B3EID5                 :1;
        unsigned B3EID6                 :1;
        unsigned B3EID7                 :1;
    };
} B3EIDLbits_t;
