MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K80/mcu.h
extern volatile B4D2bits_t B4D2bits __at(0xEC8);
// bitfield macros
#define _B4D2_B4D2_POSN                                     0x0
#define _B4D2_B4D2_POSITION                                 0x0
#define _B4D2_B4D2_SIZE                                     0x8
#define _B4D2_B4D2_LENGTH                                   0x8
#define _B4D2_B4D2_MASK                                     0xFF
#define _B4D2_B4D20_POSN                                    0x0
#define _B4D2_B4D20_POSITION                                0x0
#define _B4D2_B4D20_SIZE                                    0x1
#define _B4D2_B4D20_LENGTH                                  0x1
#define _B4D2_B4D20_MASK                                    0x1
#define _B4D2_B4D21_POSN                                    0x1
#define _B4D2_B4D21_POSITION                                0x1
#define _B4D2_B4D21_SIZE                                    0x1
#define _B4D2_B4D21_LENGTH                                  0x1
#define _B4D2_B4D21_MASK                                    0x2
#define _B4D2_B4D22_POSN                                    0x2
#define _B4D2_B4D22_POSITION                                0x2
#define _B4D2_B4D22_SIZE                                    0x1
#define _B4D2_B4D22_LENGTH                                  0x1
#define _B4D2_B4D22_MASK                                    0x4
#define _B4D2_B4D23_POSN                                    0x3
#define _B4D2_B4D23_POSITION                                0x3
#define _B4D2_B4D23_SIZE                                    0x1
#define _B4D2_B4D23_LENGTH                                  0x1
#define _B4D2_B4D23_MASK                                    0x8
#define _B4D2_B4D24_POSN                                    0x4
#define _B4D2_B4D24_POSITION                                0x4
#define _B4D2_B4D24_SIZE                                    0x1
#define _B4D2_B4D24_LENGTH                                  0x1
#define _B4D2_B4D24_MASK                                    0x10
#define _B4D2_B4D25_POSN                                    0x5
#define _B4D2_B4D25_POSITION                                0x5
#define _B4D2_B4D25_SIZE                                    0x1
#define _B4D2_B4D25_LENGTH                                  0x1
#define _B4D2_B4D25_MASK                                    0x20
#define _B4D2_B4D26_POSN                                    0x6
#define _B4D2_B4D26_POSITION                                0x6
#define _B4D2_B4D26_SIZE                                    0x1
#define _B4D2_B4D26_LENGTH                                  0x1
#define _B4D2_B4D26_MASK                                    0x40
#define _B4D2_B4D27_POSN                                    0x7
#define _B4D2_B4D27_POSITION                                0x7
#define _B4D2_B4D27_SIZE                                    0x1
#define _B4D2_B4D27_LENGTH                                  0x1
#define _B4D2_B4D27_MASK                                    0x80

// Register: B4D3
#define B4D3 B4D3
extern volatile unsigned char           B4D3                __at(0xEC9);
#ifndef _LIB_BUILD
asm("B4D3 equ 0EC9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D3                   :8;
    };
    struct {
        unsigned B4D30                  :1;
        unsigned B4D31                  :1;
        unsigned B4D32                  :1;
        unsigned B4D33                  :1;
        unsigned B4D34                  :1;
        unsigned B4D35                  :1;
        unsigned B4D36                  :1;
        unsigned B4D37                  :1;
    };
} B4D3bits_t;
extern volatile B4D3bits_t B4D3bits __at(0xEC9);
// bitfield macros
#define _B4D3_B4D3_POSN                                     0x0
#define _B4D3_B4D3_POSITION                                 0x0
#define _B4D3_B4D3_SIZE                                     0x8
#define _B4D3_B4D3_LENGTH                                   0x8
#define _B4D3_B4D3_MASK                                     0xFF
#define _B4D3_B4D30_POSN                                    0x0
#define _B4D3_B4D30_POSITION                                0x0
#define _B4D3_B4D30_SIZE                                    0x1
#define _B4D3_B4D30_LENGTH                                  0x1
#define _B4D3_B4D30_MASK                                    0x1
#define _B4D3_B4D31_POSN                                    0x1
#define _B4D3_B4D31_POSITION                                0x1
#define _B4D3_B4D31_SIZE                                    0x1
#define _B4D3_B4D31_LENGTH                                  0x1
#define _B4D3_B4D31_MASK                                    0x2
#define _B4D3_B4D32_POSN                                    0x2
#define _B4D3_B4D32_POSITION                                0x2
#define _B4D3_B4D32_SIZE                                    0x1
#define _B4D3_B4D32_LENGTH                                  0x1
#define _B4D3_B4D32_MASK                                    0x4
#define _B4D3_B4D33_POSN                                    0x3
#define _B4D3_B4D33_POSITION                                0x3
#define _B4D3_B4D33_SIZE                                    0x1
#define _B4D3_B4D33_LENGTH                                  0x1
#define _B4D3_B4D33_MASK                                    0x8
#define _B4D3_B4D34_POSN                                    0x4
#define _B4D3_B4D34_POSITION                                0x4
#define _B4D3_B4D34_SIZE                                    0x1
#define _B4D3_B4D34_LENGTH                                  0x1
#define _B4D3_B4D34_MASK                                    0x10
#define _B4D3_B4D35_POSN                                    0x5
#define _B4D3_B4D35_POSITION                                0x5
#define _B4D3_B4D35_SIZE                                    0x1
#define _B4D3_B4D35_LENGTH                                  0x1
#define _B4D3_B4D35_MASK                                    0x20
#define _B4D3_B4D36_POSN                                    0x6
#define _B4D3_B4D36_POSITION                                0x6
#define _B4D3_B4D36_SIZE                                    0x1
#define _B4D3_B4D36_LENGTH                                  0x1
#define _B4D3_B4D36_MASK                                    0x40
#define _B4D3_B4D37_POSN                                    0x7
#define _B4D3_B4D37_POSITION                                0x7
#define _B4D3_B4D37_SIZE                                    0x1
#define _B4D3_B4D37_LENGTH                                  0x1
#define _B4D3_B4D37_MASK                                    0x80

// Register: B4D4
#define B4D4 B4D4
extern volatile unsigned char           B4D4                __at(0xECA);
#ifndef _LIB_BUILD
asm("B4D4 equ 0ECAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B4D4                   :8;
    };
    struct {
        unsigned B4D40                  :1;
        unsigned B4D41                  :1;
        unsigned B4D42                  :1;
        unsigned B4D43                  :1;
        unsigned B4D44                  :1;
        unsigned B4D45                  :1;
        unsigned B4D46                  :1;
        unsigned B4D47                  :1;
    };
} B4D4bits_t;
extern volatile B4D4bits_t B4D4bits __at(0xECA);
// bitfield macros
#define _B4D4_B4D4_POSN                                     0x0
#define _B4D4_B4D4_POSITION                                 0x0
#define _B4D4_B4D4_SIZE                                     0x8
#define _B4D4_B4D4_LENGTH                                   0x8
#define _B4D4_B4D4_MASK                                     0xFF
#define _B4D4_B4D40_POSN                                    0x0
#define _B4D4_B4D40_POSITION                                0x0
#define _B4D4_B4D40_SIZE                                    0x1
#define _B4D4_B4D40_LENGTH                                  0x1
#define _B4D4_B4D40_MASK                                    0x1
#define _B4D4_B4D41_POSN                                    0x1
#define _B4D4_B4D41_POSITION                                0x1
#define _B4D4_B4D41_SIZE                                    0x1
#define _B4D4_B4D41_LENGTH                                  0x1
#define _B4D4_B4D41_MASK                                    0x2
#define _B4D4_B4D42_POSN                                    0x2
#define _B4D4_B4D42_POSITION                                0x2
#define _B4D4_B4D42_SIZE                                    0x1
#define _B4D4_B4D42_LENGTH                                  0x1
#define _B4D4_B4D42_MASK                                    0x4
#define _B4D4_B4D43_POSN                                    0x3
#define _B4D4_B4D43_POSITION                                0x3
#define _B4D4_B4D43_SIZE                                    0x1
#define _B4D4_B4D43_LENGTH                                  0x1
#define _B4D4_B4D43_MASK                                    0x8
#define _B4D4_B4D44_POSN                                    0x4
#define _B4D4_B4D44_POSITION                                0x4
#define _B4D4_B4D44_SIZE                                    0x1
#define _B4D4_B4D44_LENGTH                                  0x1
#define _B4D4_B4D44_MASK                                    0x10
#define _B4D4_B4D45_POSN                                    0x5
#define _B4D4_B4D45_POSITION                                0x5
#define _B4D4_B4D45_SIZE                                    0x1
#define _B4D4_B4D45_LENGTH                                  0x1
#define _B4D4_B4D45_MASK                                    0x20
#define _B4D4_B4D46_POSN                                    0x6
#define _B4D4_B4D46_POSITION                                0x6
#define _B4D4_B4D46_SIZE                                    0x1
#define _B4D4_B4D46_LENGTH                                  0x1
#define _B4D4_B4D46_MASK                                    0x40
#define _B4D4_B4D47_POSN                                    0x7
#define _B4D4_B4D47_POSITION                                0x7
#define _B4D4_B4D47_SIZE                                    0x1
#define _B4D4_B4D47_LENGTH                                  0x1
#define _B4D4_B4D47_MASK                                    0x80

