MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K80/mcu.h
// Register: B5SIDL
#define B5SIDL B5SIDL
extern volatile unsigned char           B5SIDL              __at(0xED2);
#ifndef _LIB_BUILD
asm("B5SIDL equ 0ED2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDE                  :1;
        unsigned SRR                    :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned B5EID16                :1;
        unsigned B5EID17                :1;
        unsigned                        :1;
        unsigned B5EXID                 :1;
        unsigned B5SRR                  :1;
        unsigned B5SID0                 :1;
        unsigned B5SID1                 :1;
        unsigned B5SID2                 :1;
    };
    struct {
        unsigned                        :3;
        unsigned B5EXIDE                :1;
    };
} B5SIDLbits_t;
extern volatile B5SIDLbits_t B5SIDLbits __at(0xED2);
// bitfield macros
#define _B5SIDL_EID_POSN                                    0x0
#define _B5SIDL_EID_POSITION                                0x0
#define _B5SIDL_EID_SIZE                                    0x2
#define _B5SIDL_EID_LENGTH                                  0x2
#define _B5SIDL_EID_MASK                                    0x3
#define _B5SIDL_EXIDE_POSN                                  0x3
#define _B5SIDL_EXIDE_POSITION                              0x3
#define _B5SIDL_EXIDE_SIZE                                  0x1
#define _B5SIDL_EXIDE_LENGTH                                0x1
#define _B5SIDL_EXIDE_MASK                                  0x8
#define _B5SIDL_SRR_POSN                                    0x4
#define _B5SIDL_SRR_POSITION                                0x4
#define _B5SIDL_SRR_SIZE                                    0x1
#define _B5SIDL_SRR_LENGTH                                  0x1
#define _B5SIDL_SRR_MASK                                    0x10
#define _B5SIDL_SID_POSN                                    0x5
#define _B5SIDL_SID_POSITION                                0x5
#define _B5SIDL_SID_SIZE                                    0x3
#define _B5SIDL_SID_LENGTH                                  0x3
#define _B5SIDL_SID_MASK                                    0xE0
#define _B5SIDL_EID16_POSN                                  0x0
#define _B5SIDL_EID16_POSITION                              0x0
#define _B5SIDL_EID16_SIZE                                  0x1
#define _B5SIDL_EID16_LENGTH                                0x1
#define _B5SIDL_EID16_MASK                                  0x1
#define _B5SIDL_EID17_POSN                                  0x1
#define _B5SIDL_EID17_POSITION                              0x1
#define _B5SIDL_EID17_SIZE                                  0x1
#define _B5SIDL_EID17_LENGTH                                0x1
#define _B5SIDL_EID17_MASK                                  0x2
#define _B5SIDL_SID0_POSN                                   0x5
#define _B5SIDL_SID0_POSITION                               0x5
#define _B5SIDL_SID0_SIZE                                   0x1
#define _B5SIDL_SID0_LENGTH                                 0x1
#define _B5SIDL_SID0_MASK                                   0x20
#define _B5SIDL_SID1_POSN                                   0x6
#define _B5SIDL_SID1_POSITION                               0x6
#define _B5SIDL_SID1_SIZE                                   0x1
#define _B5SIDL_SID1_LENGTH                                 0x1
#define _B5SIDL_SID1_MASK                                   0x40
#define _B5SIDL_SID2_POSN                                   0x7
#define _B5SIDL_SID2_POSITION                               0x7
#define _B5SIDL_SID2_SIZE                                   0x1
#define _B5SIDL_SID2_LENGTH                                 0x1
#define _B5SIDL_SID2_MASK                                   0x80
#define _B5SIDL_B5EID16_POSN                                0x0
#define _B5SIDL_B5EID16_POSITION                            0x0
#define _B5SIDL_B5EID16_SIZE                                0x1
#define _B5SIDL_B5EID16_LENGTH                              0x1
#define _B5SIDL_B5EID16_MASK                                0x1
#define _B5SIDL_B5EID17_POSN                                0x1
#define _B5SIDL_B5EID17_POSITION                            0x1
#define _B5SIDL_B5EID17_SIZE                                0x1
#define _B5SIDL_B5EID17_LENGTH                              0x1
#define _B5SIDL_B5EID17_MASK                                0x2
#define _B5SIDL_B5EXID_POSN                                 0x3
#define _B5SIDL_B5EXID_POSITION                             0x3
#define _B5SIDL_B5EXID_SIZE                                 0x1
#define _B5SIDL_B5EXID_LENGTH                               0x1
#define _B5SIDL_B5EXID_MASK                                 0x8
#define _B5SIDL_B5SRR_POSN                                  0x4
#define _B5SIDL_B5SRR_POSITION                              0x4
#define _B5SIDL_B5SRR_SIZE                                  0x1
#define _B5SIDL_B5SRR_LENGTH                                0x1
#define _B5SIDL_B5SRR_MASK                                  0x10
#define _B5SIDL_B5SID0_POSN                                 0x5
#define _B5SIDL_B5SID0_POSITION                             0x5
#define _B5SIDL_B5SID0_SIZE                                 0x1
#define _B5SIDL_B5SID0_LENGTH                               0x1
#define _B5SIDL_B5SID0_MASK                                 0x20
#define _B5SIDL_B5SID1_POSN                                 0x6
#define _B5SIDL_B5SID1_POSITION                             0x6
#define _B5SIDL_B5SID1_SIZE                                 0x1
#define _B5SIDL_B5SID1_LENGTH                               0x1
#define _B5SIDL_B5SID1_MASK                                 0x40
#define _B5SIDL_B5SID2_POSN                                 0x7
#define _B5SIDL_B5SID2_POSITION                             0x7
#define _B5SIDL_B5SID2_SIZE                                 0x1
#define _B5SIDL_B5SID2_LENGTH                               0x1
#define _B5SIDL_B5SID2_MASK                                 0x80
#define _B5SIDL_B5EXIDE_POSN                                0x3
#define _B5SIDL_B5EXIDE_POSITION                            0x3
#define _B5SIDL_B5EXIDE_SIZE                                0x1
#define _B5SIDL_B5EXIDE_LENGTH                              0x1
#define _B5SIDL_B5EXIDE_MASK                                0x8

// Register: B5EIDH
#define B5EIDH B5EIDH
extern volatile unsigned char           B5EIDH              __at(0xED3);
#ifndef _LIB_BUILD
asm("B5EIDH equ 0ED3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned B5EID8                 :1;
        unsigned B5EID9                 :1;
        unsigned B5EID10                :1;
        unsigned B5EID11                :1;
        unsigned B5EID12                :1;
        unsigned B5EID13                :1;
        unsigned B5EID14                :1;
        unsigned B5EID15                :1;
    };
} B5EIDHbits_t;
