MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K80/mcu.h
// Register: RXF3SIDH
#define RXF3SIDH RXF3SIDH
extern volatile unsigned char           RXF3SIDH            __at(0xEEC);
#ifndef _LIB_BUILD
asm("RXF3SIDH equ 0EECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID                    :8;
    };
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXF3SID3               :1;
        unsigned RXF3SID4               :1;
        unsigned RXF3SID5               :1;
        unsigned RXF3SID6               :1;
        unsigned RXF3SID7               :1;
        unsigned RXF3SID8               :1;
        unsigned RXF3SID9               :1;
        unsigned RXF3SID10              :1;
    };
} RXF3SIDHbits_t;
extern volatile RXF3SIDHbits_t RXF3SIDHbits __at(0xEEC);
// bitfield macros
#define _RXF3SIDH_SID_POSN                                  0x0
#define _RXF3SIDH_SID_POSITION                              0x0
#define _RXF3SIDH_SID_SIZE                                  0x8
#define _RXF3SIDH_SID_LENGTH                                0x8
#define _RXF3SIDH_SID_MASK                                  0xFF
#define _RXF3SIDH_SID3_POSN                                 0x0
#define _RXF3SIDH_SID3_POSITION                             0x0
#define _RXF3SIDH_SID3_SIZE                                 0x1
#define _RXF3SIDH_SID3_LENGTH                               0x1
#define _RXF3SIDH_SID3_MASK                                 0x1
#define _RXF3SIDH_SID4_POSN                                 0x1
#define _RXF3SIDH_SID4_POSITION                             0x1
#define _RXF3SIDH_SID4_SIZE                                 0x1
#define _RXF3SIDH_SID4_LENGTH                               0x1
#define _RXF3SIDH_SID4_MASK                                 0x2
#define _RXF3SIDH_SID5_POSN                                 0x2
#define _RXF3SIDH_SID5_POSITION                             0x2
#define _RXF3SIDH_SID5_SIZE                                 0x1
#define _RXF3SIDH_SID5_LENGTH                               0x1
#define _RXF3SIDH_SID5_MASK                                 0x4
#define _RXF3SIDH_SID6_POSN                                 0x3
#define _RXF3SIDH_SID6_POSITION                             0x3
#define _RXF3SIDH_SID6_SIZE                                 0x1
#define _RXF3SIDH_SID6_LENGTH                               0x1
#define _RXF3SIDH_SID6_MASK                                 0x8
#define _RXF3SIDH_SID7_POSN                                 0x4
#define _RXF3SIDH_SID7_POSITION                             0x4
#define _RXF3SIDH_SID7_SIZE                                 0x1
#define _RXF3SIDH_SID7_LENGTH                               0x1
#define _RXF3SIDH_SID7_MASK                                 0x10
#define _RXF3SIDH_SID8_POSN                                 0x5
#define _RXF3SIDH_SID8_POSITION                             0x5
#define _RXF3SIDH_SID8_SIZE                                 0x1
#define _RXF3SIDH_SID8_LENGTH                               0x1
#define _RXF3SIDH_SID8_MASK                                 0x20
#define _RXF3SIDH_SID9_POSN                                 0x6
#define _RXF3SIDH_SID9_POSITION                             0x6
#define _RXF3SIDH_SID9_SIZE                                 0x1
#define _RXF3SIDH_SID9_LENGTH                               0x1
#define _RXF3SIDH_SID9_MASK                                 0x40
#define _RXF3SIDH_SID10_POSN                                0x7
#define _RXF3SIDH_SID10_POSITION                            0x7
#define _RXF3SIDH_SID10_SIZE                                0x1
#define _RXF3SIDH_SID10_LENGTH                              0x1
#define _RXF3SIDH_SID10_MASK                                0x80
#define _RXF3SIDH_RXF3SID3_POSN                             0x0
#define _RXF3SIDH_RXF3SID3_POSITION                         0x0
#define _RXF3SIDH_RXF3SID3_SIZE                             0x1
#define _RXF3SIDH_RXF3SID3_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID3_MASK                             0x1
#define _RXF3SIDH_RXF3SID4_POSN                             0x1
#define _RXF3SIDH_RXF3SID4_POSITION                         0x1
#define _RXF3SIDH_RXF3SID4_SIZE                             0x1
#define _RXF3SIDH_RXF3SID4_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID4_MASK                             0x2
#define _RXF3SIDH_RXF3SID5_POSN                             0x2
#define _RXF3SIDH_RXF3SID5_POSITION                         0x2
#define _RXF3SIDH_RXF3SID5_SIZE                             0x1
#define _RXF3SIDH_RXF3SID5_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID5_MASK                             0x4
#define _RXF3SIDH_RXF3SID6_POSN                             0x3
#define _RXF3SIDH_RXF3SID6_POSITION                         0x3
#define _RXF3SIDH_RXF3SID6_SIZE                             0x1
#define _RXF3SIDH_RXF3SID6_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID6_MASK                             0x8
#define _RXF3SIDH_RXF3SID7_POSN                             0x4
#define _RXF3SIDH_RXF3SID7_POSITION                         0x4
#define _RXF3SIDH_RXF3SID7_SIZE                             0x1
#define _RXF3SIDH_RXF3SID7_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID7_MASK                             0x10
#define _RXF3SIDH_RXF3SID8_POSN                             0x5
#define _RXF3SIDH_RXF3SID8_POSITION                         0x5
#define _RXF3SIDH_RXF3SID8_SIZE                             0x1
#define _RXF3SIDH_RXF3SID8_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID8_MASK                             0x20
#define _RXF3SIDH_RXF3SID9_POSN                             0x6
#define _RXF3SIDH_RXF3SID9_POSITION                         0x6
#define _RXF3SIDH_RXF3SID9_SIZE                             0x1
#define _RXF3SIDH_RXF3SID9_LENGTH                           0x1
#define _RXF3SIDH_RXF3SID9_MASK                             0x40
#define _RXF3SIDH_RXF3SID10_POSN                            0x7
#define _RXF3SIDH_RXF3SID10_POSITION                        0x7
#define _RXF3SIDH_RXF3SID10_SIZE                            0x1
#define _RXF3SIDH_RXF3SID10_LENGTH                          0x1
#define _RXF3SIDH_RXF3SID10_MASK                            0x80

// Register: RXF3SIDL
#define RXF3SIDL RXF3SIDL
extern volatile unsigned char           RXF3SIDL            __at(0xEED);
#ifndef _LIB_BUILD
asm("RXF3SIDL equ 0EEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :2;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID                    :3;
    };
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :3;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXF3EID16              :1;
        unsigned RXF3EID17              :1;
        unsigned                        :1;
        unsigned RXF3EXIDEN             :1;
        unsigned                        :1;
        unsigned RXF3SID0               :1;
        unsigned RXF3SID1               :1;
        unsigned RXF3SID2               :1;
    };
} RXF3SIDLbits_t;
