MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K80/mcu.h
extern volatile RXF4EIDHbits_t RXF4EIDHbits __at(0xEF2);
// bitfield macros
#define _RXF4EIDH_EID_POSN                                  0x0
#define _RXF4EIDH_EID_POSITION                              0x0
#define _RXF4EIDH_EID_SIZE                                  0x8
#define _RXF4EIDH_EID_LENGTH                                0x8
#define _RXF4EIDH_EID_MASK                                  0xFF
#define _RXF4EIDH_EID8_POSN                                 0x0
#define _RXF4EIDH_EID8_POSITION                             0x0
#define _RXF4EIDH_EID8_SIZE                                 0x1
#define _RXF4EIDH_EID8_LENGTH                               0x1
#define _RXF4EIDH_EID8_MASK                                 0x1
#define _RXF4EIDH_EID9_POSN                                 0x1
#define _RXF4EIDH_EID9_POSITION                             0x1
#define _RXF4EIDH_EID9_SIZE                                 0x1
#define _RXF4EIDH_EID9_LENGTH                               0x1
#define _RXF4EIDH_EID9_MASK                                 0x2
#define _RXF4EIDH_EID10_POSN                                0x2
#define _RXF4EIDH_EID10_POSITION                            0x2
#define _RXF4EIDH_EID10_SIZE                                0x1
#define _RXF4EIDH_EID10_LENGTH                              0x1
#define _RXF4EIDH_EID10_MASK                                0x4
#define _RXF4EIDH_EID11_POSN                                0x3
#define _RXF4EIDH_EID11_POSITION                            0x3
#define _RXF4EIDH_EID11_SIZE                                0x1
#define _RXF4EIDH_EID11_LENGTH                              0x1
#define _RXF4EIDH_EID11_MASK                                0x8
#define _RXF4EIDH_EID12_POSN                                0x4
#define _RXF4EIDH_EID12_POSITION                            0x4
#define _RXF4EIDH_EID12_SIZE                                0x1
#define _RXF4EIDH_EID12_LENGTH                              0x1
#define _RXF4EIDH_EID12_MASK                                0x10
#define _RXF4EIDH_EID13_POSN                                0x5
#define _RXF4EIDH_EID13_POSITION                            0x5
#define _RXF4EIDH_EID13_SIZE                                0x1
#define _RXF4EIDH_EID13_LENGTH                              0x1
#define _RXF4EIDH_EID13_MASK                                0x20
#define _RXF4EIDH_EID14_POSN                                0x6
#define _RXF4EIDH_EID14_POSITION                            0x6
#define _RXF4EIDH_EID14_SIZE                                0x1
#define _RXF4EIDH_EID14_LENGTH                              0x1
#define _RXF4EIDH_EID14_MASK                                0x40
#define _RXF4EIDH_EID15_POSN                                0x7
#define _RXF4EIDH_EID15_POSITION                            0x7
#define _RXF4EIDH_EID15_SIZE                                0x1
#define _RXF4EIDH_EID15_LENGTH                              0x1
#define _RXF4EIDH_EID15_MASK                                0x80
#define _RXF4EIDH_RXF4EID8_POSN                             0x0
#define _RXF4EIDH_RXF4EID8_POSITION                         0x0
#define _RXF4EIDH_RXF4EID8_SIZE                             0x1
#define _RXF4EIDH_RXF4EID8_LENGTH                           0x1
#define _RXF4EIDH_RXF4EID8_MASK                             0x1
#define _RXF4EIDH_RXF4EID9_POSN                             0x1
#define _RXF4EIDH_RXF4EID9_POSITION                         0x1
#define _RXF4EIDH_RXF4EID9_SIZE                             0x1
#define _RXF4EIDH_RXF4EID9_LENGTH                           0x1
#define _RXF4EIDH_RXF4EID9_MASK                             0x2
#define _RXF4EIDH_RXF4EID10_POSN                            0x2
#define _RXF4EIDH_RXF4EID10_POSITION                        0x2
#define _RXF4EIDH_RXF4EID10_SIZE                            0x1
#define _RXF4EIDH_RXF4EID10_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID10_MASK                            0x4
#define _RXF4EIDH_RXF4EID11_POSN                            0x3
#define _RXF4EIDH_RXF4EID11_POSITION                        0x3
#define _RXF4EIDH_RXF4EID11_SIZE                            0x1
#define _RXF4EIDH_RXF4EID11_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID11_MASK                            0x8
#define _RXF4EIDH_RXF4EID12_POSN                            0x4
#define _RXF4EIDH_RXF4EID12_POSITION                        0x4
#define _RXF4EIDH_RXF4EID12_SIZE                            0x1
#define _RXF4EIDH_RXF4EID12_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID12_MASK                            0x10
#define _RXF4EIDH_RXF4EID13_POSN                            0x5
#define _RXF4EIDH_RXF4EID13_POSITION                        0x5
#define _RXF4EIDH_RXF4EID13_SIZE                            0x1
#define _RXF4EIDH_RXF4EID13_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID13_MASK                            0x20
#define _RXF4EIDH_RXF4EID14_POSN                            0x6
#define _RXF4EIDH_RXF4EID14_POSITION                        0x6
#define _RXF4EIDH_RXF4EID14_SIZE                            0x1
#define _RXF4EIDH_RXF4EID14_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID14_MASK                            0x40
#define _RXF4EIDH_RXF4EID15_POSN                            0x7
#define _RXF4EIDH_RXF4EID15_POSITION                        0x7
#define _RXF4EIDH_RXF4EID15_SIZE                            0x1
#define _RXF4EIDH_RXF4EID15_LENGTH                          0x1
#define _RXF4EIDH_RXF4EID15_MASK                            0x80

// Register: RXF4EIDL
#define RXF4EIDL RXF4EIDL
extern volatile unsigned char           RXF4EIDL            __at(0xEF3);
#ifndef _LIB_BUILD
asm("RXF4EIDL equ 0EF3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF4EID0               :1;
        unsigned RXF4EID1               :1;
        unsigned RXF4EID2               :1;
        unsigned RXF4EID3               :1;
        unsigned RXF4EID4               :1;
        unsigned RXF4EID5               :1;
        unsigned RXF4EID6               :1;
        unsigned RXF4EID7               :1;
    };
} RXF4EIDLbits_t;
extern volatile RXF4EIDLbits_t RXF4EIDLbits __at(0xEF3);
// bitfield macros
#define _RXF4EIDL_EID_POSN                                  0x0
#define _RXF4EIDL_EID_POSITION                              0x0
#define _RXF4EIDL_EID_SIZE                                  0x8
#define _RXF4EIDL_EID_LENGTH                                0x8
#define _RXF4EIDL_EID_MASK                                  0xFF
#define _RXF4EIDL_EID0_POSN                                 0x0
#define _RXF4EIDL_EID0_POSITION                             0x0
#define _RXF4EIDL_EID0_SIZE                                 0x1
#define _RXF4EIDL_EID0_LENGTH                               0x1
#define _RXF4EIDL_EID0_MASK                                 0x1
#define _RXF4EIDL_EID1_POSN                                 0x1
#define _RXF4EIDL_EID1_POSITION                             0x1
#define _RXF4EIDL_EID1_SIZE                                 0x1
#define _RXF4EIDL_EID1_LENGTH                               0x1
#define _RXF4EIDL_EID1_MASK                                 0x2
#define _RXF4EIDL_EID2_POSN                                 0x2
#define _RXF4EIDL_EID2_POSITION                             0x2
#define _RXF4EIDL_EID2_SIZE                                 0x1
#define _RXF4EIDL_EID2_LENGTH                               0x1
#define _RXF4EIDL_EID2_MASK                                 0x4
#define _RXF4EIDL_EID3_POSN                                 0x3
#define _RXF4EIDL_EID3_POSITION                             0x3
#define _RXF4EIDL_EID3_SIZE                                 0x1
#define _RXF4EIDL_EID3_LENGTH                               0x1
#define _RXF4EIDL_EID3_MASK                                 0x8
#define _RXF4EIDL_EID4_POSN                                 0x4
#define _RXF4EIDL_EID4_POSITION                             0x4
#define _RXF4EIDL_EID4_SIZE                                 0x1
#define _RXF4EIDL_EID4_LENGTH                               0x1
#define _RXF4EIDL_EID4_MASK                                 0x10
#define _RXF4EIDL_EID5_POSN                                 0x5
#define _RXF4EIDL_EID5_POSITION                             0x5
#define _RXF4EIDL_EID5_SIZE                                 0x1
#define _RXF4EIDL_EID5_LENGTH                               0x1
#define _RXF4EIDL_EID5_MASK                                 0x20
#define _RXF4EIDL_EID6_POSN                                 0x6
#define _RXF4EIDL_EID6_POSITION                             0x6
#define _RXF4EIDL_EID6_SIZE                                 0x1
#define _RXF4EIDL_EID6_LENGTH                               0x1
#define _RXF4EIDL_EID6_MASK                                 0x40
#define _RXF4EIDL_EID7_POSN                                 0x7
#define _RXF4EIDL_EID7_POSITION                             0x7
#define _RXF4EIDL_EID7_SIZE                                 0x1
#define _RXF4EIDL_EID7_LENGTH                               0x1
#define _RXF4EIDL_EID7_MASK                                 0x80
#define _RXF4EIDL_RXF4EID0_POSN                             0x0
#define _RXF4EIDL_RXF4EID0_POSITION                         0x0
#define _RXF4EIDL_RXF4EID0_SIZE                             0x1
#define _RXF4EIDL_RXF4EID0_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID0_MASK                             0x1
#define _RXF4EIDL_RXF4EID1_POSN                             0x1
#define _RXF4EIDL_RXF4EID1_POSITION                         0x1
#define _RXF4EIDL_RXF4EID1_SIZE                             0x1
#define _RXF4EIDL_RXF4EID1_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID1_MASK                             0x2
#define _RXF4EIDL_RXF4EID2_POSN                             0x2
#define _RXF4EIDL_RXF4EID2_POSITION                         0x2
#define _RXF4EIDL_RXF4EID2_SIZE                             0x1
#define _RXF4EIDL_RXF4EID2_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID2_MASK                             0x4
#define _RXF4EIDL_RXF4EID3_POSN                             0x3
#define _RXF4EIDL_RXF4EID3_POSITION                         0x3
#define _RXF4EIDL_RXF4EID3_SIZE                             0x1
#define _RXF4EIDL_RXF4EID3_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID3_MASK                             0x8
#define _RXF4EIDL_RXF4EID4_POSN                             0x4
#define _RXF4EIDL_RXF4EID4_POSITION                         0x4
#define _RXF4EIDL_RXF4EID4_SIZE                             0x1
#define _RXF4EIDL_RXF4EID4_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID4_MASK                             0x10
#define _RXF4EIDL_RXF4EID5_POSN                             0x5
#define _RXF4EIDL_RXF4EID5_POSITION                         0x5
#define _RXF4EIDL_RXF4EID5_SIZE                             0x1
#define _RXF4EIDL_RXF4EID5_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID5_MASK                             0x20
#define _RXF4EIDL_RXF4EID6_POSN                             0x6
#define _RXF4EIDL_RXF4EID6_POSITION                         0x6
#define _RXF4EIDL_RXF4EID6_SIZE                             0x1
#define _RXF4EIDL_RXF4EID6_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID6_MASK                             0x40
#define _RXF4EIDL_RXF4EID7_POSN                             0x7
#define _RXF4EIDL_RXF4EID7_POSITION                         0x7
#define _RXF4EIDL_RXF4EID7_SIZE                             0x1
#define _RXF4EIDL_RXF4EID7_LENGTH                           0x1
#define _RXF4EIDL_RXF4EID7_MASK                             0x80

