MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K80/mcu.h
extern volatile TXB2D5bits_t TXB2D5bits __at(0xF0B);
// bitfield macros
#define _TXB2D5_TXB2D5_POSN                                 0x0
#define _TXB2D5_TXB2D5_POSITION                             0x0
#define _TXB2D5_TXB2D5_SIZE                                 0x8
#define _TXB2D5_TXB2D5_LENGTH                               0x8
#define _TXB2D5_TXB2D5_MASK                                 0xFF
#define _TXB2D5_TXB2D50_POSN                                0x0
#define _TXB2D5_TXB2D50_POSITION                            0x0
#define _TXB2D5_TXB2D50_SIZE                                0x1
#define _TXB2D5_TXB2D50_LENGTH                              0x1
#define _TXB2D5_TXB2D50_MASK                                0x1
#define _TXB2D5_TXB2D51_POSN                                0x1
#define _TXB2D5_TXB2D51_POSITION                            0x1
#define _TXB2D5_TXB2D51_SIZE                                0x1
#define _TXB2D5_TXB2D51_LENGTH                              0x1
#define _TXB2D5_TXB2D51_MASK                                0x2
#define _TXB2D5_TXB2D52_POSN                                0x2
#define _TXB2D5_TXB2D52_POSITION                            0x2
#define _TXB2D5_TXB2D52_SIZE                                0x1
#define _TXB2D5_TXB2D52_LENGTH                              0x1
#define _TXB2D5_TXB2D52_MASK                                0x4
#define _TXB2D5_TXB2D53_POSN                                0x3
#define _TXB2D5_TXB2D53_POSITION                            0x3
#define _TXB2D5_TXB2D53_SIZE                                0x1
#define _TXB2D5_TXB2D53_LENGTH                              0x1
#define _TXB2D5_TXB2D53_MASK                                0x8
#define _TXB2D5_TXB2D54_POSN                                0x4
#define _TXB2D5_TXB2D54_POSITION                            0x4
#define _TXB2D5_TXB2D54_SIZE                                0x1
#define _TXB2D5_TXB2D54_LENGTH                              0x1
#define _TXB2D5_TXB2D54_MASK                                0x10
#define _TXB2D5_TXB2D55_POSN                                0x5
#define _TXB2D5_TXB2D55_POSITION                            0x5
#define _TXB2D5_TXB2D55_SIZE                                0x1
#define _TXB2D5_TXB2D55_LENGTH                              0x1
#define _TXB2D5_TXB2D55_MASK                                0x20
#define _TXB2D5_TXB2D56_POSN                                0x6
#define _TXB2D5_TXB2D56_POSITION                            0x6
#define _TXB2D5_TXB2D56_SIZE                                0x1
#define _TXB2D5_TXB2D56_LENGTH                              0x1
#define _TXB2D5_TXB2D56_MASK                                0x40
#define _TXB2D5_TXB2D57_POSN                                0x7
#define _TXB2D5_TXB2D57_POSITION                            0x7
#define _TXB2D5_TXB2D57_SIZE                                0x1
#define _TXB2D5_TXB2D57_LENGTH                              0x1
#define _TXB2D5_TXB2D57_MASK                                0x80

// Register: TXB2D6
#define TXB2D6 TXB2D6
extern volatile unsigned char           TXB2D6              __at(0xF0C);
#ifndef _LIB_BUILD
asm("TXB2D6 equ 0F0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D6                 :8;
    };
    struct {
        unsigned TXB2D60                :1;
        unsigned TXB2D61                :1;
        unsigned TXB2D62                :1;
        unsigned TXB2D63                :1;
        unsigned TXB2D64                :1;
        unsigned TXB2D65                :1;
        unsigned TXB2D66                :1;
        unsigned TXB2D67                :1;
    };
} TXB2D6bits_t;
extern volatile TXB2D6bits_t TXB2D6bits __at(0xF0C);
// bitfield macros
#define _TXB2D6_TXB2D6_POSN                                 0x0
#define _TXB2D6_TXB2D6_POSITION                             0x0
#define _TXB2D6_TXB2D6_SIZE                                 0x8
#define _TXB2D6_TXB2D6_LENGTH                               0x8
#define _TXB2D6_TXB2D6_MASK                                 0xFF
#define _TXB2D6_TXB2D60_POSN                                0x0
#define _TXB2D6_TXB2D60_POSITION                            0x0
#define _TXB2D6_TXB2D60_SIZE                                0x1
#define _TXB2D6_TXB2D60_LENGTH                              0x1
#define _TXB2D6_TXB2D60_MASK                                0x1
#define _TXB2D6_TXB2D61_POSN                                0x1
#define _TXB2D6_TXB2D61_POSITION                            0x1
#define _TXB2D6_TXB2D61_SIZE                                0x1
#define _TXB2D6_TXB2D61_LENGTH                              0x1
#define _TXB2D6_TXB2D61_MASK                                0x2
#define _TXB2D6_TXB2D62_POSN                                0x2
#define _TXB2D6_TXB2D62_POSITION                            0x2
#define _TXB2D6_TXB2D62_SIZE                                0x1
#define _TXB2D6_TXB2D62_LENGTH                              0x1
#define _TXB2D6_TXB2D62_MASK                                0x4
#define _TXB2D6_TXB2D63_POSN                                0x3
#define _TXB2D6_TXB2D63_POSITION                            0x3
#define _TXB2D6_TXB2D63_SIZE                                0x1
#define _TXB2D6_TXB2D63_LENGTH                              0x1
#define _TXB2D6_TXB2D63_MASK                                0x8
#define _TXB2D6_TXB2D64_POSN                                0x4
#define _TXB2D6_TXB2D64_POSITION                            0x4
#define _TXB2D6_TXB2D64_SIZE                                0x1
#define _TXB2D6_TXB2D64_LENGTH                              0x1
#define _TXB2D6_TXB2D64_MASK                                0x10
#define _TXB2D6_TXB2D65_POSN                                0x5
#define _TXB2D6_TXB2D65_POSITION                            0x5
#define _TXB2D6_TXB2D65_SIZE                                0x1
#define _TXB2D6_TXB2D65_LENGTH                              0x1
#define _TXB2D6_TXB2D65_MASK                                0x20
#define _TXB2D6_TXB2D66_POSN                                0x6
#define _TXB2D6_TXB2D66_POSITION                            0x6
#define _TXB2D6_TXB2D66_SIZE                                0x1
#define _TXB2D6_TXB2D66_LENGTH                              0x1
#define _TXB2D6_TXB2D66_MASK                                0x40
#define _TXB2D6_TXB2D67_POSN                                0x7
#define _TXB2D6_TXB2D67_POSITION                            0x7
#define _TXB2D6_TXB2D67_SIZE                                0x1
#define _TXB2D6_TXB2D67_LENGTH                              0x1
#define _TXB2D6_TXB2D67_MASK                                0x80

// Register: TXB2D7
#define TXB2D7 TXB2D7
extern volatile unsigned char           TXB2D7              __at(0xF0D);
#ifndef _LIB_BUILD
asm("TXB2D7 equ 0F0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D7                 :8;
    };
    struct {
        unsigned TXB2D70                :1;
        unsigned TXB2D71                :1;
        unsigned TXB2D72                :1;
        unsigned TXB2D73                :1;
        unsigned TXB2D74                :1;
        unsigned TXB2D75                :1;
        unsigned TXB2D76                :1;
        unsigned TXB2D77                :1;
    };
} TXB2D7bits_t;
extern volatile TXB2D7bits_t TXB2D7bits __at(0xF0D);
// bitfield macros
#define _TXB2D7_TXB2D7_POSN                                 0x0
#define _TXB2D7_TXB2D7_POSITION                             0x0
#define _TXB2D7_TXB2D7_SIZE                                 0x8
#define _TXB2D7_TXB2D7_LENGTH                               0x8
#define _TXB2D7_TXB2D7_MASK                                 0xFF
#define _TXB2D7_TXB2D70_POSN                                0x0
#define _TXB2D7_TXB2D70_POSITION                            0x0
#define _TXB2D7_TXB2D70_SIZE                                0x1
#define _TXB2D7_TXB2D70_LENGTH                              0x1
#define _TXB2D7_TXB2D70_MASK                                0x1
#define _TXB2D7_TXB2D71_POSN                                0x1
#define _TXB2D7_TXB2D71_POSITION                            0x1
#define _TXB2D7_TXB2D71_SIZE                                0x1
#define _TXB2D7_TXB2D71_LENGTH                              0x1
#define _TXB2D7_TXB2D71_MASK                                0x2
#define _TXB2D7_TXB2D72_POSN                                0x2
#define _TXB2D7_TXB2D72_POSITION                            0x2
#define _TXB2D7_TXB2D72_SIZE                                0x1
#define _TXB2D7_TXB2D72_LENGTH                              0x1
#define _TXB2D7_TXB2D72_MASK                                0x4
#define _TXB2D7_TXB2D73_POSN                                0x3
#define _TXB2D7_TXB2D73_POSITION                            0x3
#define _TXB2D7_TXB2D73_SIZE                                0x1
#define _TXB2D7_TXB2D73_LENGTH                              0x1
#define _TXB2D7_TXB2D73_MASK                                0x8
#define _TXB2D7_TXB2D74_POSN                                0x4
#define _TXB2D7_TXB2D74_POSITION                            0x4
#define _TXB2D7_TXB2D74_SIZE                                0x1
#define _TXB2D7_TXB2D74_LENGTH                              0x1
#define _TXB2D7_TXB2D74_MASK                                0x10
#define _TXB2D7_TXB2D75_POSN                                0x5
#define _TXB2D7_TXB2D75_POSITION                            0x5
#define _TXB2D7_TXB2D75_SIZE                                0x1
#define _TXB2D7_TXB2D75_LENGTH                              0x1
#define _TXB2D7_TXB2D75_MASK                                0x20
#define _TXB2D7_TXB2D76_POSN                                0x6
#define _TXB2D7_TXB2D76_POSITION                            0x6
#define _TXB2D7_TXB2D76_SIZE                                0x1
#define _TXB2D7_TXB2D76_LENGTH                              0x1
#define _TXB2D7_TXB2D76_MASK                                0x40
#define _TXB2D7_TXB2D77_POSN                                0x7
#define _TXB2D7_TXB2D77_POSITION                            0x7
#define _TXB2D7_TXB2D77_SIZE                                0x1
#define _TXB2D7_TXB2D77_LENGTH                              0x1
#define _TXB2D7_TXB2D77_MASK                                0x80

