MikroElektronika/core_packages/PIC/XC8/def/PIC18LF25K80/mcu.h
extern volatile RXB1EIDHbits_t RXB1EIDHbits __at(0xF33);
// bitfield macros
#define _RXB1EIDH_EID_POSN                                  0x0
#define _RXB1EIDH_EID_POSITION                              0x0
#define _RXB1EIDH_EID_SIZE                                  0x8
#define _RXB1EIDH_EID_LENGTH                                0x8
#define _RXB1EIDH_EID_MASK                                  0xFF
#define _RXB1EIDH_EID8_POSN                                 0x0
#define _RXB1EIDH_EID8_POSITION                             0x0
#define _RXB1EIDH_EID8_SIZE                                 0x1
#define _RXB1EIDH_EID8_LENGTH                               0x1
#define _RXB1EIDH_EID8_MASK                                 0x1
#define _RXB1EIDH_EID9_POSN                                 0x1
#define _RXB1EIDH_EID9_POSITION                             0x1
#define _RXB1EIDH_EID9_SIZE                                 0x1
#define _RXB1EIDH_EID9_LENGTH                               0x1
#define _RXB1EIDH_EID9_MASK                                 0x2
#define _RXB1EIDH_EID10_POSN                                0x2
#define _RXB1EIDH_EID10_POSITION                            0x2
#define _RXB1EIDH_EID10_SIZE                                0x1
#define _RXB1EIDH_EID10_LENGTH                              0x1
#define _RXB1EIDH_EID10_MASK                                0x4
#define _RXB1EIDH_EID11_POSN                                0x3
#define _RXB1EIDH_EID11_POSITION                            0x3
#define _RXB1EIDH_EID11_SIZE                                0x1
#define _RXB1EIDH_EID11_LENGTH                              0x1
#define _RXB1EIDH_EID11_MASK                                0x8
#define _RXB1EIDH_EID12_POSN                                0x4
#define _RXB1EIDH_EID12_POSITION                            0x4
#define _RXB1EIDH_EID12_SIZE                                0x1
#define _RXB1EIDH_EID12_LENGTH                              0x1
#define _RXB1EIDH_EID12_MASK                                0x10
#define _RXB1EIDH_EID13_POSN                                0x5
#define _RXB1EIDH_EID13_POSITION                            0x5
#define _RXB1EIDH_EID13_SIZE                                0x1
#define _RXB1EIDH_EID13_LENGTH                              0x1
#define _RXB1EIDH_EID13_MASK                                0x20
#define _RXB1EIDH_EID14_POSN                                0x6
#define _RXB1EIDH_EID14_POSITION                            0x6
#define _RXB1EIDH_EID14_SIZE                                0x1
#define _RXB1EIDH_EID14_LENGTH                              0x1
#define _RXB1EIDH_EID14_MASK                                0x40
#define _RXB1EIDH_EID15_POSN                                0x7
#define _RXB1EIDH_EID15_POSITION                            0x7
#define _RXB1EIDH_EID15_SIZE                                0x1
#define _RXB1EIDH_EID15_LENGTH                              0x1
#define _RXB1EIDH_EID15_MASK                                0x80
#define _RXB1EIDH_RXB1EID8_POSN                             0x0
#define _RXB1EIDH_RXB1EID8_POSITION                         0x0
#define _RXB1EIDH_RXB1EID8_SIZE                             0x1
#define _RXB1EIDH_RXB1EID8_LENGTH                           0x1
#define _RXB1EIDH_RXB1EID8_MASK                             0x1
#define _RXB1EIDH_RXB1EID9_POSN                             0x1
#define _RXB1EIDH_RXB1EID9_POSITION                         0x1
#define _RXB1EIDH_RXB1EID9_SIZE                             0x1
#define _RXB1EIDH_RXB1EID9_LENGTH                           0x1
#define _RXB1EIDH_RXB1EID9_MASK                             0x2
#define _RXB1EIDH_RXB1EID10_POSN                            0x2
#define _RXB1EIDH_RXB1EID10_POSITION                        0x2
#define _RXB1EIDH_RXB1EID10_SIZE                            0x1
#define _RXB1EIDH_RXB1EID10_LENGTH                          0x1
#define _RXB1EIDH_RXB1EID10_MASK                            0x4
#define _RXB1EIDH_RXB1EID11_POSN                            0x3
#define _RXB1EIDH_RXB1EID11_POSITION                        0x3
#define _RXB1EIDH_RXB1EID11_SIZE                            0x1
#define _RXB1EIDH_RXB1EID11_LENGTH                          0x1
#define _RXB1EIDH_RXB1EID11_MASK                            0x8
#define _RXB1EIDH_RXB1EID12_POSN                            0x4
#define _RXB1EIDH_RXB1EID12_POSITION                        0x4
#define _RXB1EIDH_RXB1EID12_SIZE                            0x1
#define _RXB1EIDH_RXB1EID12_LENGTH                          0x1
#define _RXB1EIDH_RXB1EID12_MASK                            0x10
#define _RXB1EIDH_RXB1EID13_POSN                            0x5
#define _RXB1EIDH_RXB1EID13_POSITION                        0x5
#define _RXB1EIDH_RXB1EID13_SIZE                            0x1
#define _RXB1EIDH_RXB1EID13_LENGTH                          0x1
#define _RXB1EIDH_RXB1EID13_MASK                            0x20
#define _RXB1EIDH_RXB1EID14_POSN                            0x6
#define _RXB1EIDH_RXB1EID14_POSITION                        0x6
#define _RXB1EIDH_RXB1EID14_SIZE                            0x1
#define _RXB1EIDH_RXB1EID14_LENGTH                          0x1
#define _RXB1EIDH_RXB1EID14_MASK                            0x40
#define _RXB1EIDH_RXB1EID15_POSN                            0x7
#define _RXB1EIDH_RXB1EID15_POSITION                        0x7
#define _RXB1EIDH_RXB1EID15_SIZE                            0x1
#define _RXB1EIDH_RXB1EID15_LENGTH                          0x1
#define _RXB1EIDH_RXB1EID15_MASK                            0x80

// Register: RXB1EIDL
#define RXB1EIDL RXB1EIDL
extern volatile unsigned char           RXB1EIDL            __at(0xF34);
#ifndef _LIB_BUILD
asm("RXB1EIDL equ 0F34h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID                    :8;
    };
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXB1EID0               :1;
        unsigned RXB1EID1               :1;
        unsigned RXB1EID2               :1;
        unsigned RXB1EID3               :1;
        unsigned RXB1EID4               :1;
        unsigned RXB1EID5               :1;
        unsigned RXB1EID6               :1;
        unsigned RXB1EID7               :1;
    };
} RXB1EIDLbits_t;
extern volatile RXB1EIDLbits_t RXB1EIDLbits __at(0xF34);
// bitfield macros
#define _RXB1EIDL_EID_POSN                                  0x0
#define _RXB1EIDL_EID_POSITION                              0x0
#define _RXB1EIDL_EID_SIZE                                  0x8
#define _RXB1EIDL_EID_LENGTH                                0x8
#define _RXB1EIDL_EID_MASK                                  0xFF
#define _RXB1EIDL_EID0_POSN                                 0x0
#define _RXB1EIDL_EID0_POSITION                             0x0
#define _RXB1EIDL_EID0_SIZE                                 0x1
#define _RXB1EIDL_EID0_LENGTH                               0x1
#define _RXB1EIDL_EID0_MASK                                 0x1
#define _RXB1EIDL_EID1_POSN                                 0x1
#define _RXB1EIDL_EID1_POSITION                             0x1
#define _RXB1EIDL_EID1_SIZE                                 0x1
#define _RXB1EIDL_EID1_LENGTH                               0x1
#define _RXB1EIDL_EID1_MASK                                 0x2
#define _RXB1EIDL_EID2_POSN                                 0x2
#define _RXB1EIDL_EID2_POSITION                             0x2
#define _RXB1EIDL_EID2_SIZE                                 0x1
#define _RXB1EIDL_EID2_LENGTH                               0x1
#define _RXB1EIDL_EID2_MASK                                 0x4
#define _RXB1EIDL_EID3_POSN                                 0x3
#define _RXB1EIDL_EID3_POSITION                             0x3
#define _RXB1EIDL_EID3_SIZE                                 0x1
#define _RXB1EIDL_EID3_LENGTH                               0x1
#define _RXB1EIDL_EID3_MASK                                 0x8
#define _RXB1EIDL_EID4_POSN                                 0x4
#define _RXB1EIDL_EID4_POSITION                             0x4
#define _RXB1EIDL_EID4_SIZE                                 0x1
#define _RXB1EIDL_EID4_LENGTH                               0x1
#define _RXB1EIDL_EID4_MASK                                 0x10
#define _RXB1EIDL_EID5_POSN                                 0x5
#define _RXB1EIDL_EID5_POSITION                             0x5
#define _RXB1EIDL_EID5_SIZE                                 0x1
#define _RXB1EIDL_EID5_LENGTH                               0x1
#define _RXB1EIDL_EID5_MASK                                 0x20
#define _RXB1EIDL_EID6_POSN                                 0x6
#define _RXB1EIDL_EID6_POSITION                             0x6
#define _RXB1EIDL_EID6_SIZE                                 0x1
#define _RXB1EIDL_EID6_LENGTH                               0x1
#define _RXB1EIDL_EID6_MASK                                 0x40
#define _RXB1EIDL_EID7_POSN                                 0x7
#define _RXB1EIDL_EID7_POSITION                             0x7
#define _RXB1EIDL_EID7_SIZE                                 0x1
#define _RXB1EIDL_EID7_LENGTH                               0x1
#define _RXB1EIDL_EID7_MASK                                 0x80
#define _RXB1EIDL_RXB1EID0_POSN                             0x0
#define _RXB1EIDL_RXB1EID0_POSITION                         0x0
#define _RXB1EIDL_RXB1EID0_SIZE                             0x1
#define _RXB1EIDL_RXB1EID0_LENGTH                           0x1
#define _RXB1EIDL_RXB1EID0_MASK                             0x1
#define _RXB1EIDL_RXB1EID1_POSN                             0x1
#define _RXB1EIDL_RXB1EID1_POSITION                         0x1
#define _RXB1EIDL_RXB1EID1_SIZE                             0x1
#define _RXB1EIDL_RXB1EID1_LENGTH                           0x1
#define _RXB1EIDL_RXB1EID1_MASK                             0x2
#define _RXB1EIDL_RXB1EID2_POSN                             0x2
#define _RXB1EIDL_RXB1EID2_POSITION                         0x2
#define _RXB1EIDL_RXB1EID2_SIZE                             0x1
#define _RXB1EIDL_RXB1EID2_LENGTH                           0x1
#define _RXB1EIDL_RXB1EID2_MASK                             0x4
#define _RXB1EIDL_RXB1EID3_POSN                             0x3
#define _RXB1EIDL_RXB1EID3_POSITION                         0x3
#define _RXB1EIDL_RXB1EID3_SIZE                             0x1
#define _RXB1EIDL_RXB1EID3_LENGTH                           0x1
#define _RXB1EIDL_RXB1EID3_MASK                             0x8
#define _RXB1EIDL_RXB1EID4_POSN                             0x4
#define _RXB1EIDL_RXB1EID4_POSITION                         0x4
#define _RXB1EIDL_RXB1EID4_SIZE                             0x1
#define _RXB1EIDL_RXB1EID4_LENGTH                           0x1
#define _RXB1EIDL_RXB1EID4_MASK                             0x10
#define _RXB1EIDL_RXB1EID5_POSN                             0x5
#define _RXB1EIDL_RXB1EID5_POSITION                         0x5
#define _RXB1EIDL_RXB1EID5_SIZE                             0x1
#define _RXB1EIDL_RXB1EID5_LENGTH                           0x1
#define _RXB1EIDL_RXB1EID5_MASK                             0x20
#define _RXB1EIDL_RXB1EID6_POSN                             0x6
#define _RXB1EIDL_RXB1EID6_POSITION                         0x6
#define _RXB1EIDL_RXB1EID6_SIZE                             0x1
#define _RXB1EIDL_RXB1EID6_LENGTH                           0x1
#define _RXB1EIDL_RXB1EID6_MASK                             0x40
#define _RXB1EIDL_RXB1EID7_POSN                             0x7
#define _RXB1EIDL_RXB1EID7_POSITION                         0x7
#define _RXB1EIDL_RXB1EID7_SIZE                             0x1
#define _RXB1EIDL_RXB1EID7_LENGTH                           0x1
#define _RXB1EIDL_RXB1EID7_MASK                             0x80

